app/views/groups/show.html.erb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1  [["group_id", 1]]
---

<% @group.transactions.each do |transaction| %>