app/controllers/entities_controller.rb

INSERT INTO "entities" ("name", "amount", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "new"], ["amount", "100"], ["created_at", "2023-01-10 17:55:26.024830"], ["updated_at", "2023-01-10 17:55:26.024830"], ["user_id", 1]]
---
  def create
    @entity = @group.entities.new(entity_params)
    if @entity.save

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_group
    @group = current_user.groups.find(params[:group_id])

SELECT "entities".* FROM "entities" WHERE "entities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_entity
    @entity = @group.entities.find(params[:id])