app/controllers/entities_controller.rb

INSERT INTO "entities" ("name", "amount", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "new"], ["amount", "100"], ["created_at", "2023-01-10 17:55:26.024830"], ["updated_at", "2023-01-10 17:55:26.024830"], ["user_id", 1]]
---
  def create
    @current_user = current_user
    @entity = current_user.entities.new(entity_params)

    respond_to do |format|
      if @entity.save