app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
---
  def index
    @current_user = current_user
    @groups = current_user.groups

INSERT INTO "groups" ("name", "icon", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "wfgb"], ["icon", nil], ["created_at", "2023-01-10 17:50:21.360215"], ["updated_at", "2023-01-10 17:50:21.360215"], ["user_id", 1]]
---
  def create
    @group = current_user.groups.new(group_params)

    respond_to do |format|
      if @group.save

UPDATE "groups" SET "updated_at" = $1 WHERE "groups"."id" = $2  [["updated_at", "2023-01-10 17:50:21.388269"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)